{"basics":{"name":"Winston Wei-Han Chou","label":"Undergraduate Student","image":"https://github.com/WinstonHChou/winstonhchou.github.io/assets/img/winston_profile_pic.jpeg","email":"winston.ckhs@gmail.com","url":"https://winstonhchou.github.io/","summary":"Aspiring applied Scientist and Roboticist focus on Engineering, Physics, and Management Studies. Currently studying at the University of California, San Diego. Passionate about advancing research in robotics, artificial intelligence, and applied sciences. Committed to promoting STEM education through various outreach programs and initiatives."},"education":[{"institution":"University of California, San Diego","location":"San Diego, United States","url":"https://ucsd.edu/","area":"BS in Mechanical & Aerospace Engineering, Specialized in Controls & Robotics | GPA: 3.99/4.0","studyType":"Bachelor of Science","startDate":"2022-09-19","endDate":"present","score":"10","courses":["<strong>Robotics</strong>: Introduction to Autonomous Vehicles, Robotics (Graduate), Sensing and Estimation in Robotics (Graduate), Machine Learning for Robotics (Graduate)","<strong>Control</strong>: Linear Control, Signals and Systems","<strong>AI/ML</strong>: Machine Learning for Robotics (Graduate), Probability and Statistical Methods for Engineering, Computational Methods in Engineering","<strong>Mechanical</strong>: Design of Machine Elements, Computational Methods for Design, Solid Mechanics I, Mechanical Behavior of Materials"]}],"skills":[{"name":"Software & Embedded","level":"Master","icon":"fa-solid fa-microchip","keywords":["<strong>Programming Languages:<strong></strong>","Python, C++, C, LabVIEW, MATLAB, Java, HTML","<strong>Tools</strong>:","ROS, ROS2 (Robot Operating System), Git, Docker, Keras, Tensorflow"]},{"name":"Mechanical","level":"Advanced","icon":"fa-solid fa-cogs","keywords":["<strong>Tools</strong>:","Fusion 360, SolidWorks","<strong>Skills:</strong>","Machinery, CNC, SolidWorks CAM, FEA"]},{"name":"Expertise","level":"Expert","icon":"fa-solid fa-brain","keywords":["System Engineering","Machine Learning","Embedded Systems","Sensor Fusion","Control Systems"]}],"experience":[{"organization":"UC San Diego, ECE & MAE Department","location":"San Diego, CA","position":"Teaching Assistant, ECEMAE 148 Introduction to Autonomous Vehicles","url":"https://ece.ucsd.edu/","startDate":"2024-09-01","endDate":null,"summary":"Facilitate discussion sections, coach students on projects and assignments, and hold weekly office hours for ECEMAE 148. Support student learning in robotics system integration, computer vision, navigation algorithms, computational strategies, machine learning systems, and vehicle dynamics.","highlights":["Guide students in robotics system integration, computer vision, navigation algorithms, and machine learning.","Coach on programming assignments and project development.","Hold weekly office hours to support student learning."]},{"organization":"Flytech Technology Ltd.","location":"Taipei City, Taiwan","position":"Summer Intern","url":"https://www.flytech.com.tw/","startDate":"2024-06-01","endDate":"2024-07-31","summary":"Developed features for the Autonomous Mobile Robot (AMR) product line and improved odometry accuracy through sensor integration and control algorithm implementation.","highlights":["Integrated AMR position and velocity data into ROS, enabling remote PID tuning.","Designed encoder accuracy experiments, identified and reduced wheel sensor errors, and improved odometry by 0.49%.","Implemented Ramsete Controller to support odometry testing and planner development."]},{"organization":"AI Racing Tech","location":"San Diego, CA","position":"Simulation Team - dSPACE Simulation Developer","url":"https://www.airacingtech.com/","startDate":"2024-09-01","endDate":null,"summary":"Contribute to the Indy Autonomous Challenge, focusing on autonomous vehicle simulation and performance optimization using dSPACE systems.","highlights":["Develop and manage simulation interfaces for real-time testing of autonomous driving algorithms.","Integrate MATLAB/Simulink models with dSPACE hardware-in-the-loop (HIL) simulators.","Collaborate with cross-functional teams to optimize simulation workflows."]},{"organization":"Triton AI, UC San Diego","location":"San Diego, CA","position":"GoKart Software Team Lead / F1TENTH Racer Team Lead","url":"https://tritonai.ucsd.edu/","startDate":"2024-05-01","endDate":null,"summary":"Lead software development and autonomous racing for full-scale electric go-kart and F1TENTH teams, participating in international competitions.","highlights":["Managed a team of 20+ engineers developing sensor fusion, trajectory planning, and motion control algorithms.","Oversaw participation in the Autonomous Karting Series and F1TENTH Autonomous Grand Prix.","Led teams in competitions organized by IEEE IV, ICRA, and IROS."]},{"organization":"FRC#8020 CyberpunK, C.K. Robotics","location":"Taipei City, Taiwan","position":"Mentor","url":"https://www.ckrobotics.org/","startDate":"2021-09-01","endDate":null,"summary":"Mentor for FIRST Robotics Competition team, guiding students in advanced control theory, robot design, and competition strategy.","highlights":["Mentored 40+ students in robotics system development, control algorithms, and fabrication techniques.","Guided implementation of Kalman filter algorithms and FEA-based design verification.","Introduced advanced failure prediction and design methodologies for competition robots."]}],"projects":[{"name":"Quantum Computing","summary":"Quantum computing is the use of quantum-mechanical phenomena such as superposition and entanglement to perform computation. Computers that perform quantum computations are known as quantum computers.","highlights":["Quantum Teleportation","Quantum Cryptography"],"startDate":"2018-01-01","endDate":"2018-01-01","url":"https://example.com"}],"awards":[{"title":"Nobel Prize in Physics","date":"1921-11-01","awarder":"Royal Swedish Academy of Sciences","url":"https://www.nobelprize.org/prizes/physics/1921/einstein/biographical/","summary":"The Nobel Prizes are five separate prizes that, according to Alfred Nobel's will of 1895, are awarded to 'those who, during the preceding year, have conferred the greatest benefit to humankind.'"}],"interests":[{"name":"Physics","icon":"fa-solid fa-tag","keywords":["Quantum Mechanics","Quantum Computing","Quantum Information","Quantum Cryptography","Quantum Communication","Quantum Teleportation"]}]}